# Lets get Started

The word import means bring to library

In [1]:
import pandas as pd

In [5]:
1+2

3

In [6]:
3*4

12

In [9]:
s = pd.Series([3,4,5,6,7])

In [10]:
s

0    3
1    4
2    5
3    6
4    7
dtype: int64

In [11]:
s.head()

0    3
1    4
2    5
3    6
4    7
dtype: int64

In [13]:
ufo = pd.read_table('http://bit.ly/uforeports', sep=',')

In [14]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [15]:
ufo['State']

0        NY
1        NJ
2        CO
3        KS
4        NY
5        ND
6        CA
7        MI
8        AK
9        OR
10       CA
11       AL
12       SC
13       IA
14       MI
15       CA
16       CA
17       GA
18       TN
19       AK
20       NE
21       LA
22       LA
23       KY
24       WV
25       CA
26       WV
27       NM
28       NM
29       UT
         ..
18211    MA
18212    CA
18213    CA
18214    TX
18215    TX
18216    CA
18217    CO
18218    TX
18219    CA
18220    CA
18221    NH
18222    PA
18223    SC
18224    OK
18225    CA
18226    CA
18227    CA
18228    TX
18229    IL
18230    CA
18231    CA
18232    WI
18233    AK
18234    CA
18235    AZ
18236    IL
18237    IA
18238    WI
18239    WI
18240    FL
Name: State, Length: 18241, dtype: object

In [18]:
ufo['Location'] = ufo.City + ',' + ufo.State

In [19]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca,NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro,NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke,CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene,KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair,NY"

In [31]:
ufo.columns

Index(['City', 'Shape Reported', 'State', 'Time', 'Location'], dtype='object')

In [33]:
ufo.drop('Shape Reported', axis=1, inplace=True)

In [34]:
ufo.head()

                   City State             Time                 Location
0                Ithaca    NY   6/1/1930 22:00                Ithaca,NY
1           Willingboro    NJ  6/30/1930 20:00           Willingboro,NJ
2               Holyoke    CO  2/15/1931 14:00               Holyoke,CO
3               Abilene    KS   6/1/1931 13:00               Abilene,KS
4  New York Worlds Fair    NY  4/18/1933 19:00  New York Worlds Fair,NY

In [35]:
ufo.drop(['Time', 'State'], axis=1, inplace=True)
ufo.head()

                   City                 Location
0                Ithaca                Ithaca,NY
1           Willingboro           Willingboro,NJ
2               Holyoke               Holyoke,CO
3               Abilene               Abilene,KS
4  New York Worlds Fair  New York Worlds Fair,NY

In [36]:
ufo = pd.read_table('http://bit.ly/uforeports', sep=',')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [39]:
ufo.State.sort_values(ascending = False).head(25)

12079    WY
11490    WY
11333    WY
4866     WY
3326     WY
3328     WY
16594    WY
1177     WY
378      WY
5065     WY
7684     WY
6116     WY
10729    WY
12072    WY
16637    WY
14618    WY
7491     WY
12063    WY
14240    WY
14586    WY
15667    WY
7485     WY
14747    WY
1461     WY
1442     WY
Name: State, dtype: object

In [41]:
ufo.sort_values(City).head()

NameError: name 'City' is not defined